let data = [
    {
        nq : "1 - ",
        q:"أي من التالي مثال على مزايا أدوات التعاون عبر الانترنت :",
        a1 : "عدة مستخدمين لاستخدام تطبيق واحد في نفس الوقت",
        a2 : "عدة مستخدمين لاستخدام عدة تطبيقات في نفس الوقت",
        a3 : "مستخدم واحد لاستخدام تطبيق واحد في نفس الوقت",
        a4 : "مستخدم واحد لاستخدام عدة تطبيقات في نفس الوقت.",
        ra : "عدة مستخدمين لاستخدام تطبيق واحد في نفس الوقت"
    },
    {
        nq : "2 - ",
        q:"حقوق الملكية الفكرية هي :",
        a1 : "حماية ملكية حقوق الفكر الإبداعية لمالكها/مالكيها",
        a2 : "حماية حقوق الفكر الإبداعية للشركات فقط",
        a3 : "حماية حقوق الفكر السياسية",
        a4 : "حماية سرقة البيانات والهوية ",
        ra : "حماية ملكية حقوق الفكر الإبداعية لمالكها/مالكيها"
    },
    {
        nq : "3 - ",
        q:"الويكي هي :",
        a1 : "موقع يسمح بأنشاء الصفحات وتعديلها  وربطها بسهولة",
        a2 : "موقع يعرض المعلومات العلمية فقط على مواقع الويب",
        a3 : "برنامج مكافحة فيروسات",
        a4 : "برنامج تطبيقي للتواصل الاجتماعي عبر الانترنت",
        ra : "موقع يسمح بأنشاء الصفحات وتعديلها  وربطها بسهولة"
    },
    {
        nq : "4 - ",
        q:"لتجنب المخاطر الأمنية عند استخدام الهواتف النقالة يجب علينا :",
        a1 : "استخدام PIN",
        a2 : "إيقاف تشغيل البلوتوث",
        a3 : "الاتصال الدائم بالانترنت",
        a4 : "الرد على جميع رسائل البريد الالكتروني الواردة",
        ra : "استخدام PIN"
    },
    {
        nq : "5 - ",
        q:"الجهاز اللوحي Tablet هو :",
        a1 : "جهاز صغير يجمع بين الحاسوب و أجهزة المساعد الرقمي",
        a2 : "جهاز صغير يجمع بين الهاتف و أجهزة المساعد الرقمي",
        a3 : "جهاز صغير لتطبيقات الجداول الالكترونية",
        a4 : "جهاز صغير يستخدم للالعاب الالكترونية",
        ra : "جهاز صغير يجمع بين الحاسوب و أجهزة المساعد الرقمي"
    },
    {
        nq : "6 - ",
        q:"برنامج يمنعك من مشاركة الملفات عبر الانترنت",
        a1 : "مكافحة الفيروسات",
        a2 : "الجدار الناري",
        a3 : "برامج أنظمة التشغيل",
        a4 : "تطبيقات مشغل الوسائط",
        ra : "الجدار الناري"
    },
    {
        nq : "7 - ",
        q:"مخاطر استخدام أدوات التعاون عبر الإنترنت :",
        a1 : "سهولة الوصول",
        a2 : "الانتشار العالمي",
        a3 : "سرقة الهوية",
        a4 : "العمل الجماعي",
        ra : "سرقة الهوية"
    },
    {
        nq : "8 - ",
        q:"ماذا يطلق على الشبكة المستخدمة المتاحة في المطارات والمطاعم:",
        a1 : "الشبكة العنكبوتية",
        a2 : "الشبكة المحلية السلكية",
        a3 : "الشبكة الواسعة اللاسلكية",
        a4 : "الشبكة المحلية اللاسلكية",
        ra : "الشبكة المحلية اللاسلكية"
    },
    {
        nq : "9 - ",
        q:"يسمح بمشاركة البيانات لعدة مستخدمين :",
        a1 : "التخزين عبر الإنترنت",
        a2 : "الجدار الناري",
        a3 : "البريد الالكتروني",
        a4 : "البرامج التطبيقية",
        ra : "التخزين عبر الإنترنت"
    },
    {
        nq : "10 - ",
        q:"من الادوات التي تسمح للمستخدمين إنشاء المستندات وتحريرها وصيانتها بشكل تعاوني هي :",
        a1 : "برامج نسخ الملفات",
        a2 : "برامج حماية الملفات",
        a3 : "الحوسبة السحابية",
        a4 : "برامج تشفير الوثائق",
        ra : "الحوسبة السحابية"
    },
    {
        nq : "11 - ",
        q:"من أنظمة التخزين السحابي :",
        a1 : "iCloud",
        a2 : "Twitter",
        a3 : "Facebook",
        a4 : "Microsoft",
        ra : "iCloud"
    },
    {
        nq : "12 - ",
        q:"أي من التالي ليس من التطبيقات الانتاجية :",
        a1 : "IM",
        a2 : "التواصل الاجتماعي",
        a3 : "البريد الالكتروني",
        a4 : "لا شيء مما ذكر",
        ra : "لا شيء مما ذكر"
    },
    {
        nq : "13 - ",
        q:"تشير بيئة التعلم VLE  الى  :",
        a1 : "طالب او مجموعة طلاب في صف حقيقي ووقت حقيقي",
        a2 : "طالب او مجموعة طلاب في صف حقيقي عبر الانترنت ووقت حقيقي",
        a3 : "الأدوات المستخدمة لمعرفة جدول الحصص والامتحانات",
        a4 : "طالب او مجموعة طلاب يحضرون دروس التي يريدونها عبر الانترنت بالوقت المناسب لهم",
        ra : "طالب او مجموعة طلاب في صف حقيقي عبر الانترنت ووقت حقيقي"
    },
    {
        nq : "14 - ",
        q:"لاستخدام أدوات التعاون عبر الانترنت نحتاج الى :",
        a1 : "المكونات الإضافية Plug-ins",
        a2 : "الحاسوب",
        a3 : "الموجه",
        a4 : "لا شيء مما ذكر",
        ra : "المكونات الإضافية Plug-ins"
    },
    {
        nq : "15 - ",
        q:"من محددات التخزين عبر الانترنت؟",
        a1 : "مساحة تخزين لا نهائية",
        a2 : "لا تسمح بمشاركة الملفات",
        a3 : "مساحة تخزين محددة",
        a4 : "لا تسمح بالنسخ الاحتياطي",
        ra : "مساحة تخزين محددة"
    },
    {
        nq : "16 - ",
        q:"ما المقصود بالمزامنة ؟",
        a1 : "ضمان أن يكون المحتوى متوافر على شبكة الانترنت",
        a2 : "ضمان أن يكون المحتوى متوافر على أحد أجهزتي",
        a3 : "ضمان أن يكون المحتوى محدث على أحد أجهزتي",
        a4 : "ضمان أن يكون المحتوى محدث على جميع أجهزتي",
        ra : "ضمان أن يكون المحتوى محدث على جميع أجهزتي"
    },
    {
        nq : "17 - ",
        q:"الأدوات المستخدمة لمعرفة جدول الحصص والامتحانات:",
        a1 : "LMS",
        a2 : "VLE",
        a3 : "OLE",
        a4 : "ICT",
        ra : "OLE"
    }
]